tutorials/1D-HeatExchange-5ms/0/pointPriority
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "0";
    object      pointPriority;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


2613
(
1826152451
1000898693
-194329885
1073769654
-1007885660
1062590567
-1991596188
-1147604404
-989560466
1073770895
-1007885643
1062590567
477219090
994865607
-1784791045
1073772136
-1007885675
1062590567
1826152114
1000898693
1716071569
1073773377
-1007885658
1062590567
1348933886
999820990
920840988
1073774618
-1007885643
1062590567
869648862
-1147604403
125610406
1073775859
-1007885660
1062590567
-1991596188
-1147604404
-668494274
1073777099
-1007885658
1062590567
1826152451
1000898693
-1463724855
1073778340
-1007885676
1062590567
869648076
-1147604403
2036011860
1073779581
-1007885658
1062590567
1826152451
1000898693
1241907178
1073780822
-1007885660
1062590567
-1991596188
-1147604404
446676599
1073782063
-1007885659
1062590567
869648515
-1147604403
-348553983
1073783303
-1007885658
1062590567
1348933886
999820990
-1142658664
1073784544
-1007885658
1062590567
1826152451
1000898693
-1937889244
1073785785
-1007885660
1062590567
477218588
994865607
1561847471
1073787026
-1007885644
1062590567
-1991595841
-1147604404
767742790
1073788267
-1007885674
1062590567
1826152021
1000898693
...
)


// ************************************************************************* //
