tutorials/1D-HeatExchange-5ms/constant/FLUID/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    exteriorWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       199;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       399;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       400;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       401;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          400;
        startFace       601;
    }
)

// ************************************************************************* //
