tutorials/1D-HeatExchange-5ms/constant/FLUID/porousProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhoSolid           2250;  // solid density, kg/m3
cPSolid             850;  // solid heat capacity, J/kg/K
kappaSolid            1;  // solid thermal conductivity, W/m/K
porosity          0.635;  // porosity
porousZoneName porosity;  // porous zone name
useOverallU        true;  // use overall heat transfer coefficient within OpenFOAM
useOverallUconst  false;  // calculate overall heat transfer coeffient within OpenFOAM
overallUconst       100;  // constant overall U value, applied only if useOverallUconst true;
diamTube         0.0253;  // tube diameter, m
diamParticle    0.01271;  // particle diameter, m
Twall               973;  // wall temperature, K


// ************************************************************************* //
