tutorials/1D-HeatExchange-5ms/system/FLUID/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
	{
		name    porosity;
		type    cellSet;
		action  new;
		source  boxToCell;
		sourceInfo
		{
box	(0.0 -7 -7) (0.5 7 7);
		}
	}

	{
		name    porosity;
		type    cellZoneSet;
		action  new;
		source  setToCellZone;
		sourceInfo
		{
			set   porosity;
		}
	}
);
